from turtle import *

my_turtle = Turtle()#введение объекта для начала
my_turtle.speed(0)#изменяет скорость передвижения черепахи.
my_turtle.screen.setup(1200, 800) #задать окно нужного размера,где будет рисунок

# Нарисовать квадрат
def draw_rect(t):
    for x in range(0, 4):
        t.right(90)#поворот направо на 90 градусов.
        t.forward(100)#идти вперед 100 шагов (пикселей).

# Рисует квадраты в цикле
for x in range(0, 360):
    draw_rect(my_turtle)
    my_turtle.right(1)

# Необходимо, чтобы окно не закрывалось само, а только по клику(С помощью
#  команды t.screen.exitonclick() программа на Python реагирует на 
# нажатие кнопки мыши после исполнения программы. Если пользователь
#  нажмёт на левую кнопку мыши, пока курсор находится в окне для графики 
# модуля turtle, то окно закроется. t.screen.mainloop() останавливает 
# выполнение программы.)
my_turtle.screen.exitonclick()
my_turtle.screen.mainloop()